<template>
<div class="card bg-base-100 w-300 shadow-sm">
  <div class="card-body">
    <h2 class="card-title">服务政策</h2>
    <div>更新日期：<strong>2025/6/1</strong></div>
<div>生效日期：<strong>2025/5/10</strong></div>
<div role="tablist" class="tabs tabs-box">
  <input type="radio" name="my_tabs_5" role="tab" class="tab" aria-label="基本条款" />
  <div class="tab-content bg-base-100 border-base-300 p-6"><p>
 <strong><i>在您使用DecobfnekoDev提供的服务或产品时，您必须接受本《服务条款》全部内容:</i></strong>
  访问与使用此网站（HTTPS://www.nyacat.cloud）或使用此网站提供的服务（包括：DecobfnekoDev提供的服务或产品），Project Void游戏客户端及其关联服务NyanID通行证服务，NAC（NEKO-ANTICHEAT）反作弊服务 ，即代表您完全接受本《服务条款》全部内容，您不得使用本服务或产品进行任何非法用途。
  当然，在此基础上您还应当确保您接受我们的《隐私政策》。DecobfnekoDev拥有本条款的最终解释权。
  </p>
<p><strong>服务描述：</strong></p>
<p>NyanID提供玩家通行证验证服务登录Project Void或其他DecobfnekoDev的服务或产品</p>
<strong>您不得利用我们的平台服务制作、上载、复制、发布、传播或者转载如下内容：</strong>

<p> 1.反对宪法所确定的基本原则的；</p>

<p> 2.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>

<p> 3.损害国家荣誉和利益的；</p>

<p> 4.煽动民族仇恨、民族歧视，破坏民族团结的；</p>

<p> 5.破坏国家宗教政策，宣扬邪教和封建迷信的；</p>

<p> 6.散布谣言，扰乱社会秩序，破坏社会稳定的；</p>

<p> 7.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>

<p> 8.侮辱或者诽谤他人，侵害他人合法权益的；</p>

<p> 9.法律、行政法规禁止的其他内容。</p>
<strong><p>若您的账户违反以上9条规定内容，我们将按照《处罚条例》描述的内容对您账户做出惩罚，我们不会对此类行为做出任何容忍，在必要时，我们有权利保留您所有违规副本并在没有事先通知您的情况下从我们所有的服务器和CDN中永久删除您的账户。</p></strong>
<strong><p>我们会根据违规程度来决定对您账户限制或终止我们提供给您的所有服务</p></strong>
</div>

  <input type="radio" name="my_tabs_5" role="tab" class="tab" aria-label="处罚条例"  />
  <div class="tab-content bg-base-100 border-base-300 p-6">
    <strong>4. 我们如何使用信息</strong>
<strong>我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</strong>
<ul>
  <li>向您提供所有在线服务；</li>
  <li>在我们提供服务时，用于身份验证、数据统计，确保我们向您提供的产品和服务的安全性；</li>
  <li>帮助我们设计新服务，改善我们现有服务；</li>
  <li>使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；</li>
  <li>软件认证或管理软件升级；</li>
  <li>让您参与有关我们产品和服务的调查。</li>
</ul>

<strong>5. 信息共享</strong>
<p>目前，我们不会主动共享或转让您的个人信息至第三方，如存在其他共享或转让您的个人信息或您需要我们将您的个人信息共享或转让至第三方情形时，我们会直接或确认第三方征得您对上述行为的明示同意。</p>
<p>我们不会向合作伙伴分享可用于识别您个人身份的信息（例如您的姓名或电子邮件地址），除非您明确授权。</p>
<p>我们不会对外公开披露所收集的个人信息，如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。</p>
<p>随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将告知您相关情形，按照法律法规及不低于本《隐私政策》所要求的标准继续保护或要求新的控制者继续保护您的个人信息。</p>
<p>另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得您的授权同意：</p>
<ul>
  <li>与国家安全、国防安全直接相关的；</li>
  <li>与公共安全、公共卫生、重大公共利益直接相关的；</li>
  <li>犯罪侦查、起诉、审判和判决执行等直接相关的；</li>
  <li>出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</li>
  <li>个人信息主体自行向社会公众公开个人信息的；</li>
  <li>从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</li>
</ul>
</div>
  <input type="radio" name="my_tabs_5" role="tab" class="tab" aria-label="Page 3" />
  <div class="tab-content bg-base-100 border-base-300 p-6">
<strong>6. 您的权利</strong>
<p>在您使用我们的服务期间，我们可能会视产品具体情况为您提供相应的操作设置，以便您可以查询、删除、更正或撤回您的相关个人信息，您可参考相应的具体指引进行操作。此外，我们还设置了投诉举报渠道，您的意见将会得到及时的处理。如果您无法通过上述途径和方式行使您的个人信息主体权利，您可以通过本《隐私政策》中提供的联系方式提出您的请求，我们会按照法律法规的规定予以反馈。</p>
<p>当您决定不再使用我们的产品或服务时，可以申请注销账户。注销账户后，除法律法规另有规定外，我们将永久删除您储存在我们所有服务器上的全部个人信息及数据资料。</p>
<strong>7. 变更</strong>
<p>我们可能适时修订本《隐私政策》的条款。当变更发生时，我们会在版本更新时向您提示新的《隐私政策》，并向您说明生效日期。请您仔细阅读变更后的《隐私政策》内容，<strong>若您继续使用我们的服务，即表示您同意我们按照更新后的《隐私政策》处理您的个人信息。</strong></p>
<strong>8. 未成年人保护</strong>
<p>我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。</p></div>
</div>
<div class="join grid grid-cols-2">
</div>
  </div>
</div>

</template>

<script setup lang="ts">
import { onMounted } from 'vue';

onMounted  (() => {
  document.title = 'NyanID | 服务政策'
})
</script>
